tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Theme for zsh
brew "powerlevel10k"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "font-meslo-lg-nerd-font"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "bowlerhatllc.vscode-as3mxml"
vscode "bowlerhatllc.vscode-swf-debug"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "humao.rest-client"
vscode "mathcale.theme-dracula-refined"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "nickdemayo.vscode-json-editor"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yinfei.luahelper"
